$(document).ready(function(){
	$("select").addClass("design");
	$("input , textarea").addClass("design1");
});

 function populate(s1,s2){
	var s1 = document.getElementById(s1); 
	var s2 = document.getElementById(s2); 
	s2.innerHTML = "";
	if (s1.value == "الاردن"){
		
	var optionArray = ["|","اربد|اربد","المفرق|المفرق","جرش|جرش","عمان|عمان","الزرقاء|الزرقاء","الطفيلة|الطفيلة","عجلون|عجلون",
	"العقبة|العقبة","الكرك|الكرك","مادبا|مادبا","البلقاء|البلقاء","معان|معان"];
	}
	else if (s1.value == "الامارات العربية المتحدة"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "البحرين"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "الجزائر"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "السعودية"){
		var optionArray = ["|","الباحة|الباحة","تبوك|تبوك","جازان|جازان","الجوف|الجوف","حائل|حائل","الحدود الشمالية|الحدود الشمالية","عسير|عسير",
	"القصيم|القصيم","القطيف|القطيف","المدينة المنورة|المدينة المنورة","مكة المكرمة |مكة المكرمة ","الشرقية|الشرقية","نجران|نجران"];
	}
	else if (s1.value == "ليبيا"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "مصر"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "السودان"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "الصومال"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "العراق"){
		var optionArray = ["|","اربيل|اربيل","الأنبار|الأنبار","الديوانية|الديوانية","السليمانية|السليمانية","بابل|بابل","البصرة|البصرة","بغداد|بغداد",
	"دهوك|دهوك","ديالي|ديالي","ذي قار|ذي قار","صلاح الدين|صلاح الدين","كربلاء|كربلاء","كركوك|كركوك","المثنى|المثنى","كردستان العراق|كردستان العراق"
	,"النجف|النجف","ميسان|ميسان","نينوى|نينوى","واسط|واسط"];
	}
	else if (s1.value == "الكويت"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "المغرب"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "اليمن"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "موريتانيا"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "تونس"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "جزر القمر"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "جيبوتي"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "سوريا"){
		var optionArray = ["|","ادلب|ادلب","الحسكة|الحسكة","حلب|حلب","حماة|حماة","حمص|حمص","درعا|درعا","دمشق|دمشق",
	"السويداء|السويداء","طرطوس|طرطوس","القنيطرة|القنيطرة","اللاذقية|اللاذقية","دير الزور| دير الزور","الرقة|الرقة","ريف دمشق|ريف دمشق"];
	}
	else if (s1.value == "عمان"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "فلسطين"){
		var optionArray = ["|","اريحا|اريحا","بئر السبع|بئر السبع","بيت لحم |بيت لحم","جنين|جنين","خان يونس|خان يونس","الخليل|الخليل","دير البلح|دير البلح",
	"رام الله|رام الله","رفح | رفح","سلفيت|سلفيت","طوباس|طوباس","طول كرم|طول كرم","غزة|غزة","القدس|القدس","قلقيلية|قلقيلية","نابلس|نابلس"];
	}
	else if (s1.value == "قطر"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	else if (s1.value == "لبنان"){
		var optionArray = ["|","اربد|اربد","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق",
	"عمان|عمان","المفرق|المفرق","عمان|عمان","المفرق|المفرق","عمان|عمان"];
	}
	for(var option in optionArray){
		
		var pair = optionArray[option].split("|");
		var newOption = document.createElement("option");
		newOption.value = pair[0];
		newOption.innerHTML = pair[1];
		s2.options.add(newOption);

	}
	

 }


